In [1]:
import pandas as pd

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# Display top3 rows of dataset

In [5]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

## Check last 3 rows of dataset

In [6]:
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## Find shape of dataset

In [8]:
df.shape

(7, 3)

## get info of dataset

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

## Check null values in dataset

In [26]:
df.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

## Check non null values in dataset

In [28]:
df.notnull().sum(axis=1)

0    3
1    3
2    3
3    3
4    3
5    3
6    3
dtype: int64

## Get overall statistics about dataframe

In [14]:
df.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

## find unique values from gender column

In [18]:
df.Gender.unique()

array(['Male', 'Female'], dtype=object)

## number of unique values from gender column

In [19]:
df.Gender.nunique()

2

## display count of unique values in gender column

In [29]:
df.Gender.value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

## Find total num of students having marks between 90and 100(inclusive) using between method and without using between method

In [37]:
#without using between method
df[(df.Marks >= 90) & (df.Marks <=100)].Name.count()

4

In [41]:
#with between method
df[df.Marks.between(90, 100)].Name.count()

4

## Find average marks

In [43]:
round(df.Marks.mean())

92

## Find min marks

In [44]:
df.Marks.min()

83

## find max marks

In [45]:
df.Marks.max()

99

## find std marks

In [46]:
df.Marks.std()

6.491753010001007

## Apply method

In [47]:
def marks(x):
    return x/2

In [62]:
df['half-marks'] = df.Marks.apply(marks)
df

      Name  Marks  Gender  Male-Female  half-marks
0  Priyang     98    Male            1        49.0
1   Aadhya     89  Female            0        44.5
2   Krisha     99  Female            0        49.5
3   Vedant     87    Male            1        43.5
4   Parshv     90    Male            1        45.0
5   Mittal     83  Female            0        41.5
6  Archana     99  Female            0        49.5

In [52]:
#with lambda func
df['Marks'].apply(lambda x: x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [53]:
df.Name.apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

## Map function

In [63]:
df['Male-Female'] = df['Gender'].map({'Male': 1, 'Female': 0})
df

      Name  Marks  Gender  Male-Female  half-marks
0  Priyang     98    Male            1        49.0
1   Aadhya     89  Female            0        44.5
2   Krisha     99  Female            0        49.5
3   Vedant     87    Male            1        43.5
4   Parshv     90    Male            1        45.0
5   Mittal     83  Female            0        41.5
6  Archana     99  Female            0        49.5

## Drop the columns

In [64]:
df.drop(['Male-Female', 'half-marks'], axis=1, inplace=True)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## Print name of columns

In [65]:
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

## Sort the df as per the marks column"

In [71]:
df.sort_values(by=['Marks', 'Gender'], ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

## Display name and marks of female students

In [79]:
df[df.Gender == 'Female'][['Name', 'Marks']].sort_values(by='Marks', ascending = False)

      Name  Marks
2   Krisha     99
6  Archana     99
1   Aadhya     89
5   Mittal     83

In [82]:
df[df.Gender.isin(['Female'])].sort_values(by="Marks", ascending = False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
1   Aadhya     89  Female
5   Mittal     83  Female